tap "1password/tap"
tap "adoptopenjdk/openjdk"
tap "facebook/fb"
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/services"
tap "sidneys/homebrew"
tap "supabase/tap"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Asynchronous event library
brew "libevent"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Shared library for Watchman and Eden projects
brew "edencommon"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Git extension for versioning large files
brew "git-lfs"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Manage compile and link flags for libraries
brew "pkg-config"
# Improved top (interactive process viewer)
brew "htop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# General purpose TCP-IP emulator
brew "libslirp"
# Language Server Protocol for Markdown
brew "marksman"
# Node version management
brew "n"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Emulator for x86 and PowerPC
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.1"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# General-purpose lossless data-compression library
brew "zlib"
# A Powerful Command Line for automating iOS Simulators
brew "facebook/fb/idb-companion"
# prettier, on SPEED!
brew "fsouza/prettierd/prettierd"
# Supabase CLI
brew "supabase/tap/supabase"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# GraphQL client
cask "altair-graphql-client"
# Android SDK component
cask "android-platform-tools"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Web browser focusing on privacy
cask "brave-browser"
# Web browser
cask "firefox"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source software for live streaming and screen recording
cask "obs"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# File transfer application
cask "transmit"
vscode "aaron-bond.better-comments"
vscode "aaronthomas.vscode-snazzy-operator"
vscode "ahmadalli.vscode-nginx-conf"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "aliasadidev.nugetpackagemanagergui"
vscode "apollographql.vscode-apollo"
vscode "bengreenier.vscode-node-readme"
vscode "bmewburn.vscode-intelephense-client"
vscode "Bobj2018.status"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "clinyong.vscode-css-modules"
vscode "codezombiech.gitignore"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "dcortes92.FreeMarker"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "fireside21.cshtml-tm"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "GrapeCity.gc-excelviewer"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-execution"
vscode "GraphQL.vscode-graphql-syntax"
vscode "jevakallio.vscode-live-frame"
vscode "kreativ-software.csharpextensions"
vscode "ldez.ignore-files"
vscode "lightyen.tailwindcss-intellisense-twin"
vscode "mattconde.vscode-snazz-theme"
vscode "mblode.twig-language-2"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "morgan-codes.morgan-codes-vscode-theme"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "natqe.reload"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "paulshen.paul-typescript-toolkit"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "risabhrai.blue-moon"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "shakram02.bash-beautify"
vscode "stackbreak.comment-divider"
vscode "steoates.autoimport"
vscode "styled-components.vscode-styled-components"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "Tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "Valiantsin.operatormonodarktheme"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "WallabyJs.quokka-vscode"
vscode "william-voyek.vscode-nginx"
vscode "wix.vscode-import-cost"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "ziyasal.vscode-open-in-github"
