tap "1password/tap"
tap "adoptopenjdk/openjdk"
tap "aiotter/htop-vim"
tap "facebook/fb"
tap "felixkratz/formulae"
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "omnisharp/omnisharp-roslyn"
tap "sidneys/homebrew"
tap "supabase/tap"
tap "zegervdv/zathura"
brew "autoconf"
brew "automake"
brew "bat"
brew "boost"
brew "cmake"
brew "cocoapods"
brew "libevent"
brew "gnutls"
brew "libslirp"
brew "qemu"
brew "colima", restart_service: true
brew "coreutils"
brew "cyrus-sasl"
brew "dotenv-linter"
brew "dprint"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "gnupg"
brew "gpg-tui"
brew "helix"
brew "lazydocker"
brew "lazygit"
brew "pkg-config"
brew "libsixel"
brew "libuv"
brew "lsd"
brew "lynx"
brew "marksman"
brew "moar"
brew "yt-dlp"
brew "mpv"
brew "n"
brew "neofetch"
brew "neomutt"
brew "neovim"
brew "openvpn"
brew "pinentry-mac"
brew "postgresql@14", restart_service: true
brew "python@3.10"
brew "python@3.9"
brew "ripgrep"
brew "ruby@3.1"
brew "shfmt"
brew "stow"
brew "stylua"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "transcrypt"
brew "tree"
brew "w3m"
brew "watchman"
brew "wget"
brew "wimlib"
brew "xplr"
brew "yazi"
brew "youtube-dl"
brew "zellij"
brew "zlib"
brew "aiotter/htop-vim/htop-vim", args: ["HEAD"]
brew "facebook/fb/idb-companion"
brew "fsouza/prettierd/prettierd"
brew "koekeishiya/formulae/skhd"
brew "omnisharp/omnisharp-roslyn/omnisharp"
brew "zegervdv/zathura/girara", args: ["HEAD"]
brew "zegervdv/zathura/zathura", link: false
brew "zegervdv/zathura/zathura-pdf-mupdf"
brew "zegervdv/zathura/zathura-pdf-poppler"
cask "1password-cli"
cask "altair-graphql-client"
cask "android-platform-tools"
cask "beekeeper-studio"
cask "brave-browser"
cask "discord"
cask "dotnet-sdk"
cask "firefox"
cask "font-hack-nerd-font"
cask "gimp"
cask "google-chrome"
cask "insomnia"
cask "insomnium"
cask "logseq"
cask "multiviewer-for-f1"
cask "obs"
cask "transmit"
cask "wezterm"
vscode "aaron-bond.better-comments"
vscode "aaronthomas.vscode-snazzy-operator"
vscode "ahmadalli.vscode-nginx-conf"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "aliasadidev.nugetpackagemanagergui"
vscode "apollographql.vscode-apollo"
vscode "bengreenier.vscode-node-readme"
vscode "biomejs.biome"
vscode "bmewburn.vscode-intelephense-client"
vscode "bobj2018.status"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "clinyong.vscode-css-modules"
vscode "codezombiech.gitignore"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "dcortes92.freemarker"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "dprint.dprint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esafirm.kotlin-formatter"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "fireside21.cshtml-tm"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "fwcd.kotlin"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "jevakallio.vscode-live-frame"
vscode "kreativ-software.csharpextensions"
vscode "ldez.ignore-files"
vscode "lightyen.tailwindcss-intellisense-twin"
vscode "mattconde.vscode-snazz-theme"
vscode "mblode.twig-language-2"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "morgan-codes.morgan-codes-vscode-theme"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "natqe.reload"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "paulshen.paul-typescript-toolkit"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "risabhrai.blue-moon"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shakram02.bash-beautify"
vscode "stackbreak.comment-divider"
vscode "steoates.autoimport"
vscode "styled-components.vscode-styled-components"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tobias-z.vscode-harpoon"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "valiantsin.operatormonodarktheme"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wallabyjs.quokka-vscode"
vscode "william-voyek.vscode-nginx"
vscode "wix.vscode-import-cost"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "ziyasal.vscode-open-in-github"
